sistema/app/Controllers/Home.php

INSERT INTO `usuarios` (`nombre`, `correo`, `password`, `rol`) VALUES ('', 'admin@gmail.com', '$2y$10$KQ7t6xqTiucgCNx8u9YRhOmshbc0coPe0nlHC3SE11k0kv2PGc70q', 'aprendiz')
---
    public function guardar()
    {
        $modelo = new UsuarioModel();

        $datos = [
            'nombre'   => $this->request->getPost('nombre'),
            'correo'   => $this->request->getPost('correo'),
            'password' => password_hash(
                $this->request->getPost('password'),
                PASSWORD_DEFAULT
            ),
            'rol' => 'aprendiz'
        ];

        $modelo->insert($datos);

SELECT *
FROM `usuarios`
WHERE `correo` = 'admin1@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $modelo = new UsuarioModel();

        $correo   = $this->request->getPost('correo');
        $password = $this->request->getPost('password');

        $usuario = $modelo->where('correo', $correo)->first();

SELECT *
FROM `usuarios`
---
    public function usuarios()
    {
        if (session('rol') != 'admin') {
            return redirect()->to('/dashboard');
        }

        $modelo = new UsuarioModel();
        $datos['usuarios'] = $modelo->findAll();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '2'
---
    public function editar($id)
    {
        if (session('rol') != 'admin') {
            return redirect()->to('/dashboard');
        }

        $modelo = new UsuarioModel();
        $datos['usuario'] = $modelo->find($id);

DELETE FROM `usuarios`
WHERE `id` IN ('3')
---
    public function eliminar($id)
    {
        if (session('rol') != 'admin') {
            return redirect()->to('/dashboard');
        }

        $modelo = new UsuarioModel();
        $modelo->delete($id);