sistema/app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `correo` = 'admin1@gmail.com'
 LIMIT 1
---
    public function buscarPorCorreo(string $correo): ?array
    {
        try {
            // Condicion: validar que no este vacio
            if (empty($correo)) {
                return null;
            }

            $resultado = $this->where('correo', $correo)->first();